In [9]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
t = pd.Series([1, 3, 5, np.nan, 6, 8], index = ['a', 'b', 'c', 'd', 'e', 'f'])

In [7]:
t

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

![title](class1.png)

In [10]:
all_of_us = pd.Series(['Rivera','Panizo','Barton-Henry','Sampietro','Fragoso','Talbot','Bayer','Suñol','Daukantaite',
'Delgadillo','Roig','Ferrer','Vidal','Casamajor','Martínez','Sang'], index = ['Claudia','Eva','Kelsey','Pau','Álvaro',
'Adrien','Jordi','David ','Vilma','Jessie Lee','Roger ','Adrià','Anna','Alejandro','Nacho','Chun'])

In [11]:
all_of_us

Claudia             Rivera
Eva                 Panizo
Kelsey        Barton-Henry
Pau              Sampietro
Álvaro             Fragoso
Adrien              Talbot
Jordi                Bayer
David                Suñol
Vilma          Daukantaite
Jessie Lee      Delgadillo
Roger                 Roig
Adrià               Ferrer
Anna                 Vidal
Alejandro        Casamajor
Nacho             Martínez
Chun                  Sang
dtype: object

QUESTION: If wou were on a database, what would you use as index?

In [3]:
ironhackers = {'Claudia': 'Rivera', 'Eva': 'Panizo', 'Kelsey': 'Barton-Henry', 'Pau': 'Sampietro', 'Alvaro': 'Fragoso', 'Adrien': 'Talbot', 'Jordi': 'Bayer', 'David': 'Suñol',
              'Vilma': 'Daukantaite', 'Jessie Lee': 'Delgadillo', 'Roger': 'Roig', 'Adria': 'Ferrer', 'Anna': 'Vidal', 'Alejandro': 'Casamajor', 'Nacho': 'Martinez', 'Chun': 'Sang'
              }

In [4]:
ironhackers

{'Claudia': 'Rivera',
 'Eva': 'Panizo',
 'Kelsey': 'Barton-Henry',
 'Pau': 'Sampietro',
 'Alvaro': 'Fragoso',
 'Adrien': 'Talbot',
 'Jordi': 'Bayer',
 'David': 'Suñol',
 'Vilma': 'Daukantaite',
 'Jessie Lee': 'Delgadillo',
 'Roger': 'Roig',
 'Adria': 'Ferrer',
 'Anna': 'Vidal',
 'Alejandro': 'Casamajor',
 'Nacho': 'Martinez',
 'Chun': 'Sang'}

Similar to dictionaries right? But we can do a lot of more things with them. What if we want to add a column? Then you need something like a table, there comes the dataframes!

![title](classroom.png)

In [14]:
pd.DataFrame(all_of_us)

                       0
Claudia           Rivera
Eva               Panizo
Kelsey      Barton-Henry
Pau            Sampietro
Álvaro           Fragoso
Adrien            Talbot
Jordi              Bayer
David              Suñol
Vilma        Daukantaite
Jessie Lee    Delgadillo
Roger               Roig
Adrià             Ferrer
Anna               Vidal
Alejandro      Casamajor
Nacho           Martínez
Chun                Sang

Let's improve a little bit this df. First, the index

In [ ]:
pd.DataFrame(all_of_us)

In [17]:
last_names = pd.Series(['Rivera','Panizo','Barton-Henry','Sampietro','Fragoso','Talbot','Bayer','Suñol','Daukantaite',
'Delgadillo','Roig','Ferrer','Vidal','Casamajor','Martínez','Sang'])

In [19]:
names = pd.Series(['Claudia','Eva','Kelsey','Pau','Álvaro',
'Adrien','Jordi','David ','Vilma','Jessie Lee','Roger ','Adrià','Anna','Alejandro','Nacho','Chun'])

In [22]:
pd.DataFrame({'names': names, 'last_names': last_names})

         names    last_names
0      Claudia        Rivera
1          Eva        Panizo
2       Kelsey  Barton-Henry
3          Pau     Sampietro
4       Álvaro       Fragoso
5       Adrien        Talbot
6        Jordi         Bayer
7       David          Suñol
8        Vilma   Daukantaite
9   Jessie Lee    Delgadillo
10      Roger           Roig
11       Adrià        Ferrer
12        Anna         Vidal
13   Alejandro     Casamajor
14       Nacho      Martínez
15        Chun          Sang

In [23]:
countries = pd.Series(['Spain','Spain','US','Spain','Spain','Switzerland','Spain','Spain','Ukrania','Spain','Spain','Spain','Spain','Spain','Spain','China'])

In [24]:
pd.DataFrame({'names': names, 'last_names': last_names, 'coutries': countries })

         names    last_names     coutries
0      Claudia        Rivera        Spain
1          Eva        Panizo        Spain
2       Kelsey  Barton-Henry           US
3          Pau     Sampietro        Spain
4       Álvaro       Fragoso        Spain
5       Adrien        Talbot  Switzerland
6        Jordi         Bayer        Spain
7       David          Suñol        Spain
8        Vilma   Daukantaite      Ukrania
9   Jessie Lee    Delgadillo        Spain
10      Roger           Roig        Spain
11       Adrià        Ferrer        Spain
12        Anna         Vidal        Spain
13   Alejandro     Casamajor        Spain
14       Nacho      Martínez        Spain
15        Chun          Sang        China

Dataframes are just about adding series and series and series, and we have all the functions related to data!

I want only the names. A dataframe is like a list of series, and we access the columns exactly the same.

In [25]:
data_bootcamp = pd.DataFrame({'names': names, 'last_names': last_names, 'coutries': countries })

In [26]:
data_bootcamp['names']

0        Claudia
1            Eva
2         Kelsey
3            Pau
4         Álvaro
5         Adrien
6          Jordi
7         David
8          Vilma
9     Jessie Lee
10        Roger
11         Adrià
12          Anna
13     Alejandro
14         Nacho
15          Chun
Name: names, dtype: object

Here we have the series again, and all the info related. For the type:

In [28]:
data_bootcamp.dtypes

names         object
last_names    object
coutries      object
dtype: object

In [75]:
competition = pd.Series([1,3,5,7,8,2,4,7,4,7,5,6,9,10,4,6])

In [76]:
data_bootcamp['competition'] = competition

In [77]:
data_bootcamp

         names    last_names     coutries  competition
0      Claudia        Rivera        Spain            1
1          Eva        Panizo        Spain            3
2       Kelsey  Barton-Henry           US            5
3          Pau     Sampietro        Spain            7
4       Álvaro       Fragoso        Spain            8
5       Adrien        Talbot  Switzerland            2
6        Jordi         Bayer        Spain            4
7       David          Suñol        Spain            7
8        Vilma   Daukantaite      Ukrania            4
9   Jessie Lee    Delgadillo        Spain            7
10      Roger           Roig        Spain            5
11       Adrià        Ferrer        Spain            6
12        Anna         Vidal        Spain            9
13   Alejandro     Casamajor        Spain           10
14       Nacho      Martínez        Spain            4
15        Chun          Sang        China            6

In [78]:
data_bootcamp.dtypes

names          object
last_names     object
coutries       object
competition     int64
dtype: object

In [79]:
data_bootcamp = data_bootcamp.astype({'competition': float})

In [80]:
data_bootcamp.competition

0      1.0
1      3.0
2      5.0
3      7.0
4      8.0
5      2.0
6      4.0
7      7.0
8      4.0
9      7.0
10     5.0
11     6.0
12     9.0
13    10.0
14     4.0
15     6.0
Name: competition, dtype: float64

You always need to check the type!

Now let's get some info from the dataframe:

In [81]:
data_bootcamp[['names', 'competition']]

         names  competition
0      Claudia          1.0
1          Eva          3.0
2       Kelsey          5.0
3          Pau          7.0
4       Álvaro          8.0
5       Adrien          2.0
6        Jordi          4.0
7       David           7.0
8        Vilma          4.0
9   Jessie Lee          7.0
10      Roger           5.0
11       Adrià          6.0
12        Anna          9.0
13   Alejandro         10.0
14       Nacho          4.0
15        Chun          6.0

In [82]:
classification = data_bootcamp[['names', 'competition']]

In [83]:
classification[classification['competition'] < 4]

     names  competition
0  Claudia          1.0
1      Eva          3.0
5   Adrien          2.0

In [84]:
classification[(classification['competition'] < 4) & (classification['competition'] != 0)]

     names  competition
0  Claudia          1.0
1      Eva          3.0
5   Adrien          2.0

In [85]:
winners = classification[(classification['competition'] < 4) & (classification['competition'] != 0)]
winners

     names  competition
0  Claudia          1.0
1      Eva          3.0
5   Adrien          2.0

We could also sort the dataframe and the take only the first

In [86]:
classification.sort_values(by=['competition'])

         names  competition
0      Claudia          1.0
5       Adrien          2.0
1          Eva          3.0
6        Jordi          4.0
8        Vilma          4.0
14       Nacho          4.0
2       Kelsey          5.0
10      Roger           5.0
11       Adrià          6.0
15        Chun          6.0
3          Pau          7.0
7       David           7.0
9   Jessie Lee          7.0
4       Álvaro          8.0
12        Anna          9.0
13   Alejandro         10.0

If we want the other way? Go to the docs

In Pandas everything is about index, so if we want to take the 3 first, is like saying this is the new index we reset the index

In [90]:
classification.sort_values(by=['competition']).reset_index(drop = True)

         names  competition
0      Claudia          1.0
1       Adrien          2.0
2          Eva          3.0
3        Jordi          4.0
4        Vilma          4.0
5        Nacho          4.0
6       Kelsey          5.0
7       Roger           5.0
8        Adrià          6.0
9         Chun          6.0
10         Pau          7.0
11      David           7.0
12  Jessie Lee          7.0
13      Álvaro          8.0
14        Anna          9.0
15   Alejandro         10.0

In [91]:
classification.sort_values(by=['competition']).reset_index(drop = True).iloc[0:3]

     names  competition
0  Claudia          1.0
1   Adrien          2.0
2      Eva          3.0

If we want to copy a table then:

In [58]:
win = winners.copy()

Some mathematical functions. We can do them to all the dataframe or to one series:

In [60]:
colnames = ['Column1','Column2','Column3','Column4','Column5']
random_numbers = pd.DataFrame(np.random.random((10,5)), columns=colnames)
random_numbers

    Column1   Column2   Column3   Column4   Column5
0  0.623915  0.691264  0.610855  0.873160  0.591021
1  0.812818  0.224433  0.611273  0.577808  0.238754
2  0.633541  0.890430  0.422912  0.676552  0.995376
3  0.515155  0.027092  0.557840  0.649463  0.739976
4  0.471193  0.592510  0.806274  0.302225  0.087741
5  0.718397  0.414499  0.514737  0.778548  0.395039
6  0.898129  0.305737  0.031453  0.715235  0.260279
7  0.109176  0.598171  0.728783  0.995819  0.362348
8  0.954039  0.687265  0.415259  0.981653  0.813127
9  0.072906  0.134588  0.591386  0.667518  0.275411

In [61]:
random_numbers.sum()

Column1    5.809269
Column2    4.565988
Column3    5.290772
Column4    7.217980
Column5    4.759072
dtype: float64

In [62]:
random_numbers.sum().sum()

27.643082577422394

In [63]:
random_numbers.sum(axis=0)

Column1    5.809269
Column2    4.565988
Column3    5.290772
Column4    7.217980
Column5    4.759072
dtype: float64

In [64]:
random_numbers.sum(axis=1)

0    3.390216
1    2.465087
2    3.618812
3    2.489526
4    2.259943
5    2.821221
6    2.210831
7    2.794297
8    3.851343
9    1.741808
dtype: float64

In [66]:
random_numbers.min(axis=0)

Column1    0.072906
Column2    0.027092
Column3    0.031453
Column4    0.302225
Column5    0.087741
dtype: float64

In [67]:
random_numbers.max(axis=0)

Column1    0.954039
Column2    0.890430
Column3    0.806274
Column4    0.995819
Column5    0.995376
dtype: float64

In [68]:
random_numbers.mean(axis=0)

Column1    0.580927
Column2    0.456599
Column3    0.529077
Column4    0.721798
Column5    0.475907
dtype: float64